# LOGISTIC REGRESSION

## Bank Marketing

Abstract : The data is related with direct marketing campaigns (phone calls) of a Portuguese banking institution. The classification goal is to predict if the client will subscribe a term deposit (variable y).

Data Set Information: The data is related with direct marketing campaigns of a Portuguese banking institution. The marketing campaigns were based on phone calls. Often, more than one contact to the same client was required, in order to access if the product (bank term deposit) would be ('yes') or ('no') subscribed.

#### Importing Dataset

In [1]:
import pandas as pd
bank = pd.read_csv('C:\\Users\\Neha\\Desktop\\DataSet\\bank-additional\\bank-full.csv')
bank.head(10)

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,58,management,married,tertiary,no,2143,yes,no,unknown,5,may,261,1,-1,0,unknown,no
1,44,technician,single,secondary,no,29,yes,no,unknown,5,may,151,1,-1,0,unknown,no
2,33,entrepreneur,married,secondary,no,2,yes,yes,unknown,5,may,76,1,-1,0,unknown,no
3,47,blue-collar,married,unknown,no,1506,yes,no,unknown,5,may,92,1,-1,0,unknown,no
4,33,unknown,single,unknown,no,1,no,no,unknown,5,may,198,1,-1,0,unknown,no
5,35,management,married,tertiary,no,231,yes,no,unknown,5,may,139,1,-1,0,unknown,no
6,28,management,single,tertiary,no,447,yes,yes,unknown,5,may,217,1,-1,0,unknown,no
7,42,entrepreneur,divorced,tertiary,yes,2,yes,no,unknown,5,may,380,1,-1,0,unknown,no
8,58,retired,married,primary,no,121,yes,no,unknown,5,may,50,1,-1,0,unknown,no
9,43,technician,single,secondary,no,593,yes,no,unknown,5,may,55,1,-1,0,unknown,no

#### Check the shape of Dataset

In [2]:
bank.shape

(45211, 17)

#### Check the columns present in the dataset

In [3]:
bank.columns

Index(['age', 'job', 'marital', 'education', 'default', 'balance', 'housing',
       'loan', 'contact', 'day', 'month', 'duration', 'campaign', 'pdays',
       'previous', 'poutcome', 'y'],
      dtype='object')

#### Check the descriptive statistics of the dataset

In [4]:
bank.describe()

,age,balance,day,duration,campaign,pdays,previous
count,45211.000000,45211.000000,45211.000000,45211.000000,45211.000000,45211.000000,45211.000000
mean,40.936210,1362.272058,15.806419,258.163080,2.763841,40.197828,0.580323
std,10.618762,3044.765829,8.322476,257.527812,3.098021,100.128746,2.303441
min,18.000000,-8019.000000,1.000000,0.000000,1.000000,-1.000000,0.000000
25%,33.000000,72.000000,8.000000,103.000000,1.000000,-1.000000,0.000000
50%,39.000000,448.000000,16.000000,180.000000,2.000000,-1.000000,0.000000
75%,48.000000,1428.000000,21.000000,319.000000,3.000000,-1.000000,0.000000
max,95.000000,102127.000000,31.000000,4918.000000,63.000000,871.000000,275.000000

#### Check the info of the dataset

In [5]:
bank.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45211 entries, 0 to 45210
Data columns (total 17 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        45211 non-null  int64
 1   job        45211 non-null  object
 2   marital    45211 non-null  object
 3   education  45211 non-null  object
 4   default    45211 non-null  object
 5   balance    45211 non-null  int64
 6   housing    45211 non-null  object
 7   loan       45211 non-null  object
 8   contact    45211 non-null  object
 9   day        45211 non-null  int64
 10  month      45211 non-null  object
 11  duration   45211 non-null  int64
 12  campaign   45211 non-null  int64
 13  pdays      45211 non-null  int64
 14  previous   45211 non-null  int64
 15  poutcome   45211 non-null  object
 16  y          45211 non-null  object
dtypes: int64(7), object(10)
memory usage: 5.9+ MB

#### Code to check the min and max value of age. Also check if there is any null value or not.

In [6]:

print('Max age: ', bank['age'].max())
print('Min age: ', bank['age'].min())
print('Missing values: ', bank.isnull().any())

Max age:  95
Min age:  18
Missing values:  age          False
job          False
marital      False
education    False
default      False
balance      False
housing      False
loan         False
contact      False
day          False
month        False
duration     False
campaign     False
pdays        False
previous     False
poutcome     False
y            False
dtype: bool

#### Count of Yes and No for the term deposit

In [11]:
bank.y.value_counts()

no     39922
yes     5289
Name: y, dtype: int64

#### User defined function to calculate the Inter quartile range for quantile values outside 25 to 75 range. And do the outlier capping for lower level with min value and for upper level with 'q3=1.5*iqr' value.

In [12]:
def remove_outlier(df_in, col_name):
    q1 = df_in[col_name].quantile(0.25)
    q3 = df_in[col_name].quantile(0.75)
    iqr = q3-q1 
    lower_bound = df_in[col_name].min()
    upper_bound = q3+1.5*iqr
    print('Column',col_name,'IQR lower bound and upper bound are', lower_bound, 'and', upper_bound, 'respectively')
    df_out = df_in.loc[(df_in[col_name] > lower_bound) & (df_in[col_name] < upper_bound)]
    return df_out

#### Using the above created function , remove the outlier from 'age','campaign','duration' variables:

In [13]:
a = remove_outlier(bank, 'age')
b = remove_outlier(bank, 'campaign')
c = remove_outlier(bank, 'duration')

Column age IQR lower bound and upper bound are 18 and 70.5 respectively
Column campaign IQR lower bound and upper bound are 1 and 6.0 respectively
Column duration IQR lower bound and upper bound are 0 and 643.0 respectively

#### Dividing dataset into two, on the basis of categorical and numerical.

In [14]:
bank_cat=bank[['job', 'marital','default', 'education', 'loan', 'housing', 'contact', 'month', 'poutcome', 'y']]
bank_cat.head()

,job,marital,default,education,loan,housing,contact,month,poutcome,y
0,management,married,no,tertiary,no,yes,unknown,may,unknown,no
1,technician,single,no,secondary,no,yes,unknown,may,unknown,no
2,entrepreneur,married,no,secondary,yes,yes,unknown,may,unknown,no
3,blue-collar,married,no,unknown,no,yes,unknown,may,unknown,no
4,unknown,single,no,unknown,no,no,unknown,may,unknown,no

In [18]:
bank_cont = bank.drop(['job', 'marital','default', 'education', 'loan', 'housing', 'contact', 'month',  'poutcome', 'y'], axis=1)
bank_cont.head()

   age  balance  day  duration  campaign  pdays  previous
0   58     2143    5       261         1     -1         0
1   44       29    5       151         1     -1         0
2   33        2    5        76         1     -1         0
3   47     1506    5        92         1     -1         0
4   33        1    5       198         1     -1         0

### Label encode the below mentioned categorical variable to numerical values.


['job', 'marital','default','education', 'loan', 'housing', 'contact', 'month', 'poutcome', 'y']

In [19]:

from sklearn.preprocessing import LabelEncoder
bank_cat_new = bank_cat.apply(LabelEncoder().fit_transform)
bank_cat_new

,job,marital,default,education,loan,housing,contact,month,poutcome,y
0,4,1,0,2,0,1,2,8,3,0
1,9,2,0,1,0,1,2,8,3,0
2,2,1,0,1,1,1,2,8,3,0
3,1,1,0,3,0,1,2,8,3,0
4,11,2,0,3,0,0,2,8,3,0
...,...,...,...,...,...,...,...,...,...,...
45206,9,1,0,2,0,0,0,9,3,1
45207,5,0,0,0,0,0,0,9,3,1
45208,5,1,0,1,0,0,0,9,2,1
45209,1,1,0,1,0,0,1,9,3,0
45210,2,1,0,1,0,0,0,9,1,0

#### Combining the numerical and categorical dataset.

In [20]:
bank_final= pd.concat([bank_cont, bank_cat_new], axis = 1)
bank_final.head()

,age,balance,day,duration,campaign,pdays,previous,job,marital,default,education,loan,housing,contact,month,poutcome,y
0,58,2143,5,261,1,-1,0,4,1,0,2,0,1,2,8,3,0
1,44,29,5,151,1,-1,0,9,2,0,1,0,1,2,8,3,0
2,33,2,5,76,1,-1,0,2,1,0,1,1,1,2,8,3,0
3,47,1506,5,92,1,-1,0,1,1,0,3,0,1,2,8,3,0
4,33,1,5,198,1,-1,0,11,2,0,3,0,0,2,8,3,0

#### Extract the independent columns to prepare X

In [21]:

X = pd.DataFrame()
X = bank_final.loc[:,bank.columns != 'y']
X.head()

,age,balance,day,duration,campaign,pdays,previous,job,marital,default,education,loan,housing,contact,month,poutcome
0,58,2143,5,261,1,-1,0,4,1,0,2,0,1,2,8,3
1,44,29,5,151,1,-1,0,9,2,0,1,0,1,2,8,3
2,33,2,5,76,1,-1,0,2,1,0,1,1,1,2,8,3
3,47,1506,5,92,1,-1,0,1,1,0,3,0,1,2,8,3
4,33,1,5,198,1,-1,0,11,2,0,3,0,0,2,8,3

#### Extract dependent column into a dataframe 'y' for model prediction

In [22]:
y = pd.DataFrame()

y = bank_final.loc[:,bank_final.columns == 'y']
y.head()

   y
0  0
1  0
2  0
3  0
4  0

#### Splitting X and y into train and test dataset

In [23]:
from sklearn.model_selection import train_test_split

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.25, random_state=1)

#### Check the shape of X and y of train dataset.

In [24]:

print(X_train.shape)
print(y_train.shape)

(33908, 16)
(33908, 1)

#### Check the shape of X and y of test dataset.

In [25]:

print(X_test.shape)
print(y_test.shape)

(11303, 16)
(11303, 1)

#### Logistic Regression model using scikit-learn

In [26]:
from sklearn.linear_model import LogisticRegression
logreg = LogisticRegression()
logreg.fit(X_train,y_train)

C:\Users\Neha\anaconda3\lib\site-packages\sklearn\utils\validation.py:73: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  return f(**kwargs)
C:\Users\Neha\anaconda3\lib\site-packages\sklearn\linear_model\_logistic.py:762: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(

LogisticRegression()

#### Using the model for prediction

In [27]:
y_pred_train = pd.DataFrame()

y_pred_train = logreg.predict(X_train)

y_pred_train

array([0, 0, 0, ..., 0, 0, 0])

In [28]:
y_pred_test = pd.DataFrame()

y_pred_test = logreg.predict(X_test)

y_pred_test

array([0, 0, 0, ..., 0, 1, 0])

#### Model evaluation using accuracy classification score

In [29]:
from sklearn.metrics import accuracy_score

print('Accuracy score for test data is:', accuracy_score(y_test,y_pred_test))

Accuracy score for test data is: 0.8873750331770327

#### Model evaluation using Confusion matrix

In [30]:
from sklearn.metrics import confusion_matrix
confusion_matrix = pd.DataFrame(confusion_matrix(y_test, y_pred_test))

confusion_matrix.index = ['Actual No_Deposit','Actual Deposit']
confusion_matrix.columns = ['Predicted No_Deposit','Predicted Deposit']
print(confusion_matrix)

                   Predicted No_Deposit  Predicted Deposit
Actual No_Deposit                  9813                185
Actual Deposit                     1088                217

#### Accuracy prediction setting the threshold = 0.75

In [31]:
import numpy as np

preds1 = np.where(logreg.predict_proba(X_test)[:,1]> 0.75,1,0)
print('Accuracy score for test data is:', accuracy_score(y_test,preds1))

Accuracy score for test data is: 0.8864018402194108

#### Accuracy prediction setting the threshold = 0.25

In [32]:

preds2 = np.where(logreg.predict_proba(X_test)[:,1]> 0.25,1,0)
print('Accuracy score for test data is:', accuracy_score(y_test,preds2))

Accuracy score for test data is: 0.8640184021941077